<?php
// 该配置文件定义了一些表单选项
return [
	'sex' => [
		'未知的性别', '男', '女', '未说明的性别'
	],
	'liveType' => [
		'户籍', '非户籍'
	],
	'nation' => ['汉族', '少数民族'],
	'bloodType' => ['A型', 'B型', 'O型', 'AB型', '不详'],
	'education' => ['文盲及半文盲', '小学', '初中', '高中/技校/中专', '大学专科及以上', '不详'],
	'occupation' => ['国家机关、党群组织、企事业单位负责人', '专业技术人员', '办事人员和有关人员', '商业、服务业人员', '农、林、牧、渔、水利业生产人员', '生产、运输设备操作人员及有关人员', '军人', '不便分类的其他从业人员'],
	'marriage' => ['未婚', '已婚', '丧偶', '离婚', '其它情况'],
	'payType' => ['城镇职工基本医疗保险', '城镇居民基本医疗保险', '新型农村合作医疗', '贫困救助', '商业医疗保险', '全公费', '全自费'],
	'allergy' => ['无', '青霉素', '磺胺', '链霉素'],
	'exposure' => ['无', '化学品', '毒物', '射线'],
	'sicks' => ['无', '高血压', '糖尿病', '冠心病', '慢性阻塞性肺疾病', '恶性肿瘤', '脑卒中', '重性精神疾病', '结核病', '肝炎', '先天畸形','其它'],
	'disability' => ['视力残疾', '听力残疾', '言语残疾', '肢体残疾', '智力残疾', '精神残疾'],
	'environment' => [
		'kitchen' => ['无', '油烟机', '换气扇', '烟囱'],
		'drink' => ['自来水', '经净化过滤的水', '井水', '河湖水', '塘水', '其它'],
		'lavatory' => ['卫生厕所', '格子式粪池', '马桶', '露天粪坑', '简易棚厕'],
		'sty' => ['单设', '室内', '室外']
	],
	'symptom' => [
		'无症状', '头痛', '头晕', '心悸', '胸闷', '胸痛', '慢性咳嗽', '咳痰', '呼吸困难', '多饮', '多尿', '体重下降', '乏力', '关节肿痛', '视力模糊', '手脚麻木', '尿急', '尿痛', '便秘', '腹泻', '恶心呕吐', '眼花', '耳鸣', '乳房胀痛'
		],
	'selfHealthCheck' => [
		'满意', '基本满意', '说不清楚', '不太满意', '不满意'
	],
	'selfCareCheck' => [
		'可自理', '轻度依赖', '中度依赖', '不能自理'
	],
	'yinyang' => [
		'阴性', '阳性'
	],
	'frequency' => [
		'从不', '偶尔', '经常', '每天'
	], 
	'diet' => [
		'荤素均衡', '荤食为主', '素食为主', '嗜盐', '嗜油', '嗜糖'
	],
	'smoking' => [
		'从不吸烟', '已戒烟', '吸烟'
	],
	'mouth' => [
		'红润', '苍白', '发绀', '皲裂', '疱疹'
	],
	'teeth' => [
		'正常', '缺齿', '龋齿', '义齿(假牙)'
	],
	'throat' => [
		'无充血', '充血', '淋巴滤泡增生'
	],
	'audition' => [
		'听见', '听不清或无法听见'
	],
	'sport' => [
		'可顺利完成', '无法独立完成任一动作'
	],
	'skin' => [
		'正常', '潮红', '苍白', '发绀', '黄染', '色素沉着'
	],
	'sclera' => [
		'正常', '黄染', '充血'
	],
	'lymphaden' => [
		'未触及', '锁骨上', '腋窝'
	],
	'lung' => [
		'无', '干罗音', '湿罗音'
	],
	'heartFrequency' => [
		'齐', '不齐', '绝对不齐'
	],
	'edema' => [
		'无', '单侧', '双侧不对称', '双侧对称'
	],
	'footBack' => [
		'未触及', '触及双侧对称', '触及左侧弱或消失', '触及右侧弱或消失'
	],
	'anus' => [
		'未见异常', '触痛', '包块', '前列腺异常'
	],
	'breast' => [
		'未见异常', '乳房切除', '异常泌乳', '乳腺包块'
	],
	'brain' => [
		'未发现', '缺血性卒中', '脑出血', '蛛网膜下腔出血', '短暂性脑缺血'
	],
	'kidney' => [
		'未发现', '糖尿病肾病', '肾功能衰竭', '急性肾炎', '慢性肾炎'
	],
	'heart' => [
		'未发现', '心肌梗死', '心绞痛', '冠状动脉血运重建', '充血性心力衰竭', '心前区疼痛'
	],
	'bloodVessel' => [
		'未发现', '夹层动脉瘤', '动脉闭塞性疾病'
	],
	'eyes' => [
		'未发现', '视网膜出血或渗出', '视乳头水肿', '白内障'
	],
	'guide' => [
		'纳入慢性病患者健康管理', '建议复查', '建议转诊'
	],
	'control' => [
		'戒烟', '健康饮酒', '饮食', '锻炼'
	]
];
